Enterprise_Serivces/Prod/Bronze2/CSLAssociationService/result1/Iteration1/t8_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/association/contracts/2010/05/IAssociationService/StoreAssociation</wsa:Action><wsa:MessageID>uuid:92e24002-c406-4984-8d44-f187198c8698</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslassociationserviceqa1.testgs.pvt/AssociationService.svc</wsa:To></soap:Header><soap:Body><StoreAssociation xmlns="http://www.gamestop.com/services/csl/association/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><AssociationHandle xmlns="http://www.gamestop.com/services/csl/association/messages/2010/05">test</AssociationHandle><DistinguishingFactor xmlns="http://www.gamestop.com/services/csl/association/messages/2010/05">test</DistinguishingFactor><Expires xmlns="http://www.gamestop.com/services/csl/association/messages/2010/05">2018-02-21T00:00:00</Expires><PrivateData xmlns="http://www.gamestop.com/services/csl/association/messages/2010/05">test</PrivateData><PrivateDataLength xmlns="http://www.gamestop.com/services/csl/association/messages/2010/05">62</PrivateDataLength></request></StoreAssociation></soap:Body></soap:Envelope>